In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name":['ram','hari','sita'],
    "city":['lalitpur','hattiban','satdobato'],
    "marks":[23,44,55]
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

   name       city  marks
0   ram   lalitpur     23
1  hari   hattiban     44
2  sita  satdobato     55

In [5]:
df.to_csv('friends.csv')

In [6]:
df.head(1)

  name      city  marks
0  ram  lalitpur     23

In [7]:
df.tail(2)

   name       city  marks
1  hari   hattiban     44
2  sita  satdobato     55

In [8]:
df.describe()

           marks
count   3.000000
mean   40.666667
std    16.258331
min    23.000000
25%    33.500000
50%    44.000000
75%    49.500000
max    55.000000

In [9]:
df["marks"]

0    23
1    44
2    55
Name: marks, dtype: int64

In [11]:
df["marks"][0] = 100

C:\Users\ACER\AppData\Local\Temp\ipykernel_4224\843445103.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["marks"][0] = 100

In [12]:
df.to_csv('friend.csv')

In [13]:
df

   name       city  marks
0   ram   lalitpur    100
1  hari   hattiban     44
2  sita  satdobato     55

In [16]:
df.index = ['first','second','third']

In [17]:
df

        name       city  marks
first    ram   lalitpur    100
second  hari   hattiban     44
third   sita  satdobato     55

In [18]:
df['city']

first      lalitpur
second     hattiban
third     satdobato
Name: city, dtype: object

In [19]:
df['marks']

first     100
second     44
third      55
Name: marks, dtype: int64

In [20]:
type(df)

pandas.core.frame.DataFrame

In [22]:
ser = pd.Series(np.random.rand(33))

In [23]:
ser

0     0.798167
1     0.989364
2     0.819505
3     0.386532
4     0.099544
5     0.844261
6     0.795275
7     0.780948
8     0.174619
9     0.379213
10    0.520612
11    0.583778
12    0.770424
13    0.755722
14    0.763689
15    0.675338
16    0.101951
17    0.331490
18    0.299008
19    0.818791
20    0.830917
21    0.736924
22    0.940639
23    0.451321
24    0.937604
25    0.325392
26    0.551544
27    0.357006
28    0.515418
29    0.721785
30    0.274232
31    0.794664
32    0.702963
dtype: float64

In [24]:
type(ser)

pandas.core.series.Series

In [33]:
newdf = pd.DataFrame(np.random.rand(330,5),index = np.arange(330))

In [34]:
newdf

            0         1         2         3         4
0    0.858693  0.968012  0.316018  0.463061  0.578408
1    0.989788  0.471809  0.722745  0.701539  0.807855
2    0.512405  0.864278  0.199077  0.678127  0.417305
3    0.308043  0.080494  0.417904  0.560194  0.155879
4    0.474845  0.132426  0.521500  0.525412  0.990549
..        ...       ...       ...       ...       ...
325  0.464648  0.402959  0.226775  0.575824  0.403526
326  0.960809  0.861015  0.978585  0.895221  0.175880
327  0.903095  0.117395  0.256511  0.609194  0.937891
328  0.836862  0.045666  0.137318  0.789094  0.806165
329  0.054880  0.606833  0.213237  0.737199  0.023223

[330 rows x 5 columns]